In [15]:
import pandas as pd
dataset = pd.read_csv('sample_data.csv')
dataset.head()

      Name   Age  Gender         City   Salary
0    Alice  29.0  Female     New York  70000.0
1      Bob   NaN    Male  Los Angeles  80000.0
2  Charlie  25.0     NaN          NaN      NaN
3    David  40.0    Male          NaN  95000.0
4      Eva  30.0  Female      Phoenix  85000.0

In [4]:
dataset.isnull().sum()

Name      0
Age       2
Gender    1
City      0
Salary    2
dtype: int64

In [7]:
dataset['Gender'].fillna(dataset['Gender'].mode()[0] , inplace= True)
dataset.head()

      Name   Age  Gender         City   Salary
0    Alice  29.0  Female     New York  70000.0
1      Bob   NaN    Male  Los Angeles  80000.0
2  Charlie  25.0  Female      Chicago      NaN
3    David  40.0    Male          NaN  95000.0
4      Eva  30.0  Female      Phoenix  85000.0

In [17]:
en_data = dataset["Gender"]
en_data

0    Female
1      Male
2       NaN
3      Male
4    Female
5      Male
6    Female
Name: Gender, dtype: object

In [20]:
pd.get_dummies(en_data)

   Female   Male
0    True  False
1   False   True
2   False  False
3   False   True
4    True  False
5   False   True
6    True  False

In [10]:
from sklearn.preprocessing import OneHotEncoder

In [ ]:
ohe = OneHotEncoder()
ohe.fit_transform(en_data)

KeyError: 'Gender'